Thanks for the tip. I tried importing that, and while the importing worked, running `terraform plan` forces the bgp peer to be destroyed and recreated, even though the plan output doesn't have any indication that anything forces the re-creation.

Here's the plan output for reference

<details>
<summary>terraform plan</summary>
<pre><code>
[2020-11-25T20:34:05.358Z]   # google_compute_router_peer.bgp_peer[1] will be destroyed
[2020-11-25T20:34:05.358Z]   - resource "google_compute_router_peer" "bgp_peer" {
[2020-11-25T20:34:05.358Z]       - advertise_mode            = "CUSTOM" -> null
[2020-11-25T20:34:05.358Z]       - advertised_groups         = [] -> null
[2020-11-25T20:34:05.358Z]       - advertised_route_priority = 0 -> null
[2020-11-25T20:34:05.358Z]       - id                        = "projects/my-project/regions/europe-west3/routers/my-project-euw3-dev-1/auto-ia-bgp-my-project-euw-60eccb31ddb090b" -> null
[2020-11-25T20:34:05.358Z]       - interface                 = "auto-ia-if-my-project-euw-60eccb31ddb090b" -> null
[2020-11-25T20:34:05.358Z]       - ip_address                = "169.254.28.97" -> null
[2020-11-25T20:34:05.358Z]       - management_type           = "MANAGED_BY_ATTACHMENT" -> null
[2020-11-25T20:34:05.358Z]       - name                      = "auto-ia-bgp-my-project-euw-60eccb31ddb090b" -> null
[2020-11-25T20:34:05.358Z]       - peer_asn                  = 11111 -> null
[2020-11-25T20:34:05.358Z]       - peer_ip_address           = "169.254.28.98" -> null
[2020-11-25T20:34:05.358Z]       - project                   = "my-project" -> null
[2020-11-25T20:34:05.358Z]       - region                    = "europe-west3" -> null
[2020-11-25T20:34:05.358Z]       - router                    = "my-project-euw3-dev-1" -> null
[2020-11-25T20:34:05.358Z] 
[2020-11-25T20:34:05.358Z]       - advertised_ip_ranges {
[2020-11-25T20:34:05.358Z]           - range = "<cidr-range-1>" -> null
[2020-11-25T20:34:05.358Z]         }
[2020-11-25T20:34:05.358Z]       - advertised_ip_ranges {
[2020-11-25T20:34:05.358Z]           - range = "<cidr-range-2>" -> null
[2020-11-25T20:34:05.358Z]         }
[2020-11-25T20:34:05.358Z] 
[2020-11-25T20:34:05.358Z]       - timeouts {}
[2020-11-25T20:34:05.358Z]     }
[2020-11-25T20:34:05.358Z] 
[2020-11-25T20:34:05.358Z]   # google_compute_router_peer.bgp_peer[2] will be destroyed
[2020-11-25T20:34:05.358Z]   - resource "google_compute_router_peer" "bgp_peer" {
[2020-11-25T20:34:05.358Z]       - advertise_mode            = "CUSTOM" -> null
[2020-11-25T20:34:05.358Z]       - advertised_groups         = [] -> null
[2020-11-25T20:34:05.358Z]       - advertised_route_priority = 0 -> null
[2020-11-25T20:34:05.358Z]       - id                        = "projects/my-project/regions/europe-west3/routers/my-project-euw3-dev-2/auto-ia-bgp-my-project-euw-98a906aea32b096" -> null
[2020-11-25T20:34:05.358Z]       - interface                 = "auto-ia-if-my-project-euw-98a906aea32b096" -> null
[2020-11-25T20:34:05.358Z]       - ip_address                = "169.254.248.185" -> null
[2020-11-25T20:34:05.358Z]       - management_type           = "MANAGED_BY_ATTACHMENT" -> null
[2020-11-25T20:34:05.358Z]       - name                      = "auto-ia-bgp-my-project-euw-98a906aea32b096" -> null
[2020-11-25T20:34:05.358Z]       - peer_asn                  = 11111 -> null
[2020-11-25T20:34:05.358Z]       - peer_ip_address           = "169.254.248.186" -> null
[2020-11-25T20:34:05.358Z]       - project                   = my-project" -> null
[2020-11-25T20:34:05.358Z]       - region                    = "europe-west3" -> null
[2020-11-25T20:34:05.358Z]       - router                    = "my-project-euw3-dev-2" -> null
[2020-11-25T20:34:05.358Z] 
[2020-11-25T20:34:05.358Z]       - advertised_ip_ranges {
[2020-11-25T20:34:05.358Z]           - range = "<cidr-range-1>" -> null
[2020-11-25T20:34:05.358Z]         }
[2020-11-25T20:34:05.358Z]       - advertised_ip_ranges {
[2020-11-25T20:34:05.358Z]           - range = "<cidr-range-2>" -> null
[2020-11-25T20:34:05.358Z]         }
[2020-11-25T20:34:05.358Z] 
[2020-11-25T20:34:05.358Z]       - timeouts {}
[2020-11-25T20:34:05.358Z]     }
[2020-11-25T20:34:05.358Z] 
[2020-11-25T20:34:05.358Z]   # google_compute_router_peer.bgp_peer["1"] will be created
[2020-11-25T20:34:05.358Z]   + resource "google_compute_router_peer" "bgp_peer" {
[2020-11-25T20:34:05.358Z]       + advertise_mode            = "CUSTOM"
[2020-11-25T20:34:05.358Z]       + advertised_route_priority = 0
[2020-11-25T20:34:05.358Z]       + id                        = (known after apply)
[2020-11-25T20:34:05.358Z]       + interface                 = "auto-ia-if-my-project-euw-60eccb31ddb090b"
[2020-11-25T20:34:05.358Z]       + ip_address                = (known after apply)
[2020-11-25T20:34:05.358Z]       + management_type           = (known after apply)
[2020-11-25T20:34:05.358Z]       + name                      = "auto-ia-bgp-my-project-euw-60eccb31ddb090b"
[2020-11-25T20:34:05.359Z]       + peer_asn                  = 11111
[2020-11-25T20:34:05.359Z]       + peer_ip_address           = "169.254.28.98"
[2020-11-25T20:34:05.359Z]       + project                   = "my-project"
[2020-11-25T20:34:05.359Z]       + region                    = "europe-west3"
[2020-11-25T20:34:05.359Z]       + router                    = "my-project-euw3-dev-1"
[2020-11-25T20:34:05.359Z] 
[2020-11-25T20:34:05.359Z]       + advertised_ip_ranges {
[2020-11-25T20:34:05.359Z]           + range = "<cidr-range-1>"
[2020-11-25T20:34:05.359Z]         }
[2020-11-25T20:34:05.359Z]       + advertised_ip_ranges {
[2020-11-25T20:34:05.359Z]           + range = "<cidr-range-2>"
[2020-11-25T20:34:05.359Z]         }
[2020-11-25T20:34:05.359Z]     }
[2020-11-25T20:34:05.359Z] 
[2020-11-25T20:34:05.359Z]   # google_compute_router_peer.bgp_peer["2"] will be created
[2020-11-25T20:34:05.359Z]   + resource "google_compute_router_peer" "bgp_peer" {
[2020-11-25T20:34:05.359Z]       + advertise_mode            = "CUSTOM"
[2020-11-25T20:34:05.359Z]       + advertised_route_priority = 0
[2020-11-25T20:34:05.359Z]       + id                        = (known after apply)
[2020-11-25T20:34:05.359Z]       + interface                 = "auto-ia-if-my-project-euw-98a906aea32b096"
[2020-11-25T20:34:05.359Z]       + ip_address                = (known after apply)
[2020-11-25T20:34:05.359Z]       + management_type           = (known after apply)
[2020-11-25T20:34:05.359Z]       + name                      = "auto-ia-bgp-my-project-euw-98a906aea32b096"
[2020-11-25T20:34:05.359Z]       + peer_asn                  = 11111
[2020-11-25T20:34:05.359Z]       + peer_ip_address           = "169.254.248.186"
[2020-11-25T20:34:05.359Z]       + project                   = "my-project"
[2020-11-25T20:34:05.359Z]       + region                    = "europe-west3"
[2020-11-25T20:34:05.359Z]       + router                    = "my-project-euw3-dev-2"
[2020-11-25T20:34:05.359Z] 
[2020-11-25T20:34:05.359Z]       + advertised_ip_ranges {
[2020-11-25T20:34:05.359Z]           + range = "<cidr-range-1>"
[2020-11-25T20:34:05.359Z]         }
[2020-11-25T20:34:05.359Z]       + advertised_ip_ranges {
[2020-11-25T20:34:05.359Z]           + range = "<cidr-range-2>"
[2020-11-25T20:34:05.359Z]         }
[2020-11-25T20:34:05.359Z]     }
</code></pre>
</details>